Repository: evanb/maranello
Catalog: sites/all/modules/img_assist/translations/*.po
Languages: pt_br

source: If this site was moved or is planned to move to another domain or sub-directory, it might be needed to <a href="!empty-cache">empty the filter cache</a> to correct image paths that are pointing to the old address. Note that this will only work for images that have been inserted using filter tags.
pt_br: Se esse sítio foi movido ou se há previsão de movê-lo para outro domínio ou sub-diretório, talvez seja necessário <a href="!empty-cache">esvaziar o cache de filtros</a>" para corrigir caminhos de imagens que estiverem apontando para antigos endereços. Repare que isso só funcionará para imagens que foram inseridas utilizando tags de filtro.

source: Image reference
pt_br: Referência de imagem

source: This image appears in...
pt_br: Essa imagem aparece em

source: Access settings
pt_br: Configurações de acesso

source: Display Image assist on paths
pt_br: Mostrar Image assist nos caminhos

source: on specific paths
pt_br: nos seguintes caminhos

source: not on specific paths
pt_br: exceto nos seguintes caminhos

source: all paths
pt_br: todos os caminhos

source: Paths
pt_br: Caminhos

source: Enter one page per line as Drupal paths. The '*' character is a wildcard. Example paths are %blog for the blog page and %blog-wildcard for every personal blog. %front is the front page.
pt_br: Digite uma URL do Drupal por linha. O asterisco (*) serve como coringa. Por exemplo: blog para a página de blogs e blog/* para todos os blogs pessoais. Use <front> para a página inicial.

source: Display Image assist on text areas
pt_br: Mostrar Image assist em caixas de texto

source: Show on every textarea except the listed textareas.
pt_br: Exibir em cada área de texto exceto nas listadas.

source: Show on only the listed textareas.
pt_br: Exibir apenas nas caixas listadas.

source: Show on all textareas.
pt_br: Mostrar em todas as caixas de texto.

source: Text areas
pt_br: Caixas de texto

source: Enter one text area form-id per line. Form-id's are used by Drupal to typify them, which allows themers and coders to modify certain form fields, but not all. Find form-id's using this method: view the source of the webpage, then search for the string that's just above the text area and you'll see the form-id nearby. The '*' character is a wildcard. For example, you can specify all CCK fields as %cck-example.
pt_br: Digite um form-id de caixa de texto por linha. Form-id são usados pelo Drupal para tipificá-los, permitindo designers de tema e codeiros modificar certos campos de formulários, mas não todos. Encontre os form-ids usando o seguinte método: veja o código fonte da página e então procure pela frase que está logo antes do campo de texto e você verá o form-id por nessa região. O caractere '*' é um coringa. Por exempo, você pode especificar todos os campos CCK como %cck-example.

source: Textarea image link
pt_br: Imagem/link da caixa de texto

source: Show icon
pt_br: Mostrar ícone

source: Show text link
pt_br: Mostrar link de texto

source: Do not show a link
pt_br: Não mostrar um link

source: Choose what to show under the textareas for which Image assist is enabled.
pt_br: Escolha o que mostrar embaixo das caixas de texto quando o Image assist estiver habilitado.

source: none
pt_br: nenhum

source: Select the vocabularies to use for Image assist
pt_br: Selecione os vocabulários para usar com Image assist

source: Select the vocabularies you want to be able to filter thumbnails by. This setting changes the behavior of Image assist at startup from loading all image thumbnails to displaying a list of image names until a filter is chosen.
pt_br: Selecione os vocabulários que você quer habilitar para filtras os thumbnails por. Essa configuração altera o comportamento do Image assist no início de subir todas as miniaturas de iamgens para mostrá-las em uma lista de nomes de imagens até que um filtro seja escolhido.

source: Image generation settings
pt_br: Configuração de geração de imagens

source: Maximum inline image size allowed
pt_br: Tamanho máximo de imagem em linha permitido

source: Enter the number of maximum image dimensions to display with Image assist. This is a way to prevent users from breaking your layouts. This is applied when the filter tag is processed, so it will affect existing images. If an existing image exceeds these dimensions, a smaller derivative of the image will be substituted (or a smaller version will be created if you have allowed Image assist to create its own derivatives).
pt_br: Digite o número das dimensões máximas para exibir com o Image asist. Essa é uma forma de prevenir usuários/as de quebrarem layouts. Isso se aplica quando uma tag de filtro é processada, de forma que afeta imagens existentes. Se uma imagem existente exceder essas dimensões, um derivado menor da imagem será substituido (ou uma versão menor será criada se você permitir que o Image assist crie seus próprios derivativos).

source: Popup size
pt_br: Tamanho da janela popup

source: Select the size of the image that is popped up.
pt_br: Selecione o tamanho da imagem destacada.

source: Default size for inline images
pt_br: Tamanho padrão para imagens na mesma linha

source: Select a derivative to be used by default for inline images.
pt_br: Selecione uma derivada para ser utilizada por padrão para imagens na mesma linha (inline).

source: Creation of image derivatives
pt_br: Criação de imagens derivadas

source: Create 200x200 images for the image properties window (useful if the thumbnail size is small).
pt_br: Criar imagens de 200x200 para a janela de propriedades da imagem (útil se o tamanho da miniatura é pequeno).

source: Allow users with %access permission to create custom size inline images.
pt_br: Permite usuários/as com permissão de %access criem tamanhos personalizados para imagens na mesma linha (inline).

source: Allow all users to create custom size inline images.
pt_br: Permite que todos/as usuários/as criem tamanhos personalizados para imagens na mesma linha (inline).

source: These options allow Image assist to generate its custom image sizes (in the same manner as image.module) when a user would prefer a different size from the default image sizes defined in the image.module settings.
pt_br: Essas opções permitem ao Image assist gerar seus tamanhos de imagens personalizados (da mesma forma que o image.module) quando um usuário/a quiser um tamanho diferente do tamanho padrão definido nas configurações do image.module.

source: Image property dialog settings
pt_br: Configurações da caixa de diálogo de propriedades da imagem

source: Default link behavior
pt_br: Comportamento padrão do link

source: Not a link
pt_br: Não é um link

source: Link to image page
pt_br: Linkar para página da imagem

source: Open in popup window
pt_br: Abrir em janela popup

source: Go to URL
pt_br: Ir para URL

source: The link behavior can be overridden when inserting images by users with the proper permissions, but these defaults will still be used for everyone else.
pt_br: O comportamento do link pode ser sobrescrito quando imagens forem inseridas com as permissões adequadas, mas esses padrões continuarão sendo usados para qualquer oura pessoa.

source: Default URL
pt_br: URL padrão

source: The default URL is used when Go to URL is choosen as the link behavior.
pt_br: A URL padrão é utilizada quando Ir para URL for escolhido como comportamento padrão de link.

source: Default insert mode
pt_br: Padrão de inserção padrão

source: Filter Tag
pt_br: Tag de filtro

source: HTML Code
pt_br: Código HTML

source: The insert behavior can be overridden by users with the %permission permission when inserting images. <strong>Warning:</strong> If images are inserted as HTML, Image Assist is not able to correct a link or image URL afterwards. Please also note that users will not be able to edit already inserted images when using HTML code and the TinyMCE plugin.
pt_br: O comportamento de inserção pode ser sobrescrito por usuários/as com a permissão %permission quando inserindo imagens. <strong>Atenção:</strong> Se imagens forem inseridas como HTML, Image Assist não será capaz de corrigir o link ou a URL da imagem posteriormente. Por favor saiba também que usuários/as não poderão editar imagens já inseridas quando utilizarem código HTML e o plugin TinyMCE.

source: access advanced options
pt_br: configurações avançadas de acesso

source: Preset caption title
pt_br: Título da legenda pré-definido

source: Disabled
pt_br: Desabilitado

source: Enabled
pt_br: Habilitado

source: If enabled, the title from the image will be loaded as the bolded caption by default.
pt_br: Se habilitado, o título da imagem será carregado como legenda em negrito por padrão.

source: Requires the !token module.
pt_br: Requer o módulo !token.

source: See below for a list of available replacement patterns.
pt_br: Veja abaixo para uma lista de padrões de substituição disponíveis.

source: Caption title pattern
pt_br: Padrão de legenda

source: The pattern to generate the bolded caption title from.
pt_br: O padrão para gerar o título da legenda em negrito.

source: Preset caption text
pt_br: Texto da legenda pré-definido

source: If enabled, the body text from the image will be loaded as the caption by default.
pt_br: Se habilitado, o campo de texto da imagem será carregado como a legenda por padrão.

source: Caption text pattern
pt_br: Padrão do texto da legenda

source: The pattern to generate the caption text from.
pt_br: O padrão a partir do qual deve ser gerado o texto de legenda.

source: Replacement patterns
pt_br: Padrões de substituição

source: Image properties shown
pt_br: Propriedades da imagem mostrados

source: All selected CCK fields from the Image node will be displayed in the Image Assist pop-up window.
pt_br: Todos os campos CCK do nó Imagem serão exibidos na janela de popup do Image Assist.

source: <strong>Note:</strong> The <a href="!content-type">Image content-type</a> does not contain any CCK fields currently.
pt_br: <strong>Aviso:</strong> O <a href="!content-type">tipo de conteúdo Imagem</a> atualmente não contém nenhum campo CCK.

source: Image display settings
pt_br: Configurações de exibição de imagens

source: Include img_assist.css on all pages for styling inline images?
pt_br: Incluir o img_assist.css em todas as páginas para estilizar imagens na mesma linha (inline)?

source: yes
pt_br: sim

source: no
pt_br: não

source: Advanced users can customize their theme's CSS file so that inclusion of the img_assist.css file will not be necessary. See notes at the bottom of img_assist.css for details.
pt_br: Usuários/as avançados/as podem personalizar seus arquivos de CSS do tema de modo que a inclusão do arquivo img_assist.css não seja necessário. Veja as notas no final de img_assist.css para detahles.

source: Allowed maximum inline image size has to indicate width and height, for example %example.
pt_br: O tamanho permitido das imagens na mesma linha (inline) deve indicar tamanho e altura, por exemplo %example.

source: Inline images
pt_br: Imagens inline

source: Add images to your posts with Image assist.
pt_br: Adicionar imagens a suas postagens com Image assist.

source: Images can be added to this post.
pt_br: Imagens podem ser adicionadas a essa postagem.

source: Add image
pt_br: Adicionar imagem

source: Upload:
pt_br: Subir:

source: Fill in the form below to upload a new image.
pt_br: Preencha o formulário abaixo para subir uma nova imagem.

source: Start Over
pt_br: Começar de novo

source: Properties:
pt_br: Propriedades:

source: Change how the image is displayed.
pt_br: Altere como a imagem será exibida.

source: Browse Images:
pt_br: Buscar imagens:

source: My Images
pt_br: Minhas imagens

source: All Images
pt_br: Todas imagens

source: or
pt_br: ou

source: Upload
pt_br: Subir

source: a new image
pt_br: uma nova imagem

source: Cancel
pt_br: Cancelar

source: The image module must be enabled to use Image assist.
pt_br: O módulo image precisa estar habilitado para usar o Image assist

source: Your account does not have image uploading privileges.
pt_br: Sua conta não tem permissão para subir imagens.

source: No images were found. Please upload a new image or browse images by a different category.
pt_br: Nenhuma imagem foi encontrada. Por favor suba uma imagem ou procure em outras categorias.

source: Error: The specified view was not found.
pt_br: Erro: A view especificada não foi encontrada.

source: The Image and Views modules must be enabled to use Image assist.
pt_br: Os módulos Image e Views devem estar habilitados para usar Image assist.

source: Image ID not found
pt_br: ID de imagem não encontrado

source: Properties
pt_br: Propriedades

source: Other
pt_br: Outro

source: Image properties
pt_br: Propriedades da imagem

source: Size
pt_br: Tamanho

source: Title (optional)
pt_br: Título (opcional)

source: Description (optional)
pt_br: Descrição (opcional)

source: Size: (max @maxsize)
pt_br: Tamanho: (max @maxsize)

source: Alignment
pt_br: Alinhamento

source: left
pt_br: esquerda

source: right
pt_br: direita

source: center
pt_br: centro

source: Insert mode
pt_br: Modo de inserção

source: Update
pt_br: Atualizar

source: Insert
pt_br: Inserir

source: Unable to create %label image
pt_br: Não foi possível criar a imagem %label

source: Custom
pt_br: Personalizado

source: access img_assist
pt_br: acessar img_assist

source: access all images
pt_br: acessar todas as imagens

source: use original size
pt_br: usar tamanho original

source: Stores references of image files to content.
pt_br: Guarda referências dos arquivos de imagem ao conteúdo.

source: The {node}.nid of the content referencing the image file.
pt_br: O {node}.nid do conteúdo referente ao arquivo de imagem.

source: The {image}.nid of the image file referenced by the content.
pt_br: O {image}.nid do arquivo de imagem referenciado pelo conteúdo.

source: Image assist has been disabled, because it requires <a href="!views-url">Views</a> module to be installed.
pt_br: Image assist foi desabilitado porque requer que o módulo <a href="!views-url">Views</a> seja instalado.

source: This module allows users to upload and insert inline images into posts. It automatically generates an Add image link under the textarea fields of your choice.
pt_br: Esse módulo permite que usuários/as subam e insiram imagens em linha (inline) nas postagens. Ele automaticamente gera um link de Adicionar imagem embaixo dos campos de texto de sua escolha.

source: Image
pt_br: Imagem

source: Node teaser text (plain text)
pt_br: Texto de chamada do nó (texto plano)

source: Node body text (plain text)
pt_br: Texto do nó (texto plano)

source: Image Assist thumbnail
pt_br: Miniatura do Image Assist
